RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_pdma_regs.h
/*
 * Copyright (c) 2021-2024 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_PDMA_H
#define HPM_PDMA_H

typedef struct {
    __RW uint32_t CTRL;                        /* 0x0: Control Register */
    __RW uint32_t STAT;                        /* 0x4: Status Register */
    __RW uint32_t OUT_CTRL;                    /* 0x8: Out Layer Control Register */
    __RW uint32_t OUT_BUF;                     /* 0xC: Output buffer address */
    __R  uint8_t  RESERVED0[4];                /* 0x10 - 0x13: Reserved */
    __RW uint32_t OUT_PITCH;                   /* 0x14: Outlayer Pitch Register */
    __RW uint32_t OUT_LRC;                     /* 0x18: Output Lower Right Corner Register */
    struct {
        __RW uint32_t ULC;                     /* 0x1C: Layer Upper Left Corner Register */
        __RW uint32_t LRC;                     /* 0x20: Layer Lower Right Corner Register */
    } OUT_PS[2];
    __R  uint8_t  RESERVED1[4];                /* 0x2C - 0x2F: Reserved */
    struct {
        __RW uint32_t CTRL;                    /* 0x30: Layer Control Register */
        __RW uint32_t BUF;                     /* 0x34: Layer data buffer address */
        __R  uint8_t  RESERVED0[8];            /* 0x38 - 0x3F: Reserved */
        __RW uint32_t PITCH;                   /* 0x40: Layer data pitch register */
        __RW uint32_t BKGD;                    /* 0x44: Layer background color register */
        __RW uint32_t SCALE;                   /* 0x48: Layer scale register */
        __RW uint32_t OFFSET;                  /* 0x4C: Layer offset register */
        __RW uint32_t CLRKEY_LOW;              /* 0x50: Layer low color key register */
        __RW uint32_t CLRKEY_HIGH;             /* 0x54: Layer high color key register */
        __RW uint32_t ORG;                     /* 0x58: Layer original size register */
        __R  uint8_t  RESERVED1[4];            /* 0x5C - 0x5F: Reserved */
    } PS[2];
    __R  uint8_t  RESERVED2[16];               /* 0x90 - 0x9F: Reserved */
    __RW uint32_t YUV2RGB_COEF0;               /* 0xA0: YUV2RGB coefficients register 0 */
    __RW uint32_t YUV2RGB_COEF1;               /* 0xA4: YUV2RGB coefficients register 1 */
    __RW uint32_t YUV2RGB_COEF2;               /* 0xA8: YUV2RGB coefficients register 2 */
    __RW uint32_t RGB2YUV_COEF0;               /* 0xAC: RGB2YUV coefficients register 0 */
    __RW uint32_t RGB2YUV_COEF1;               /* 0xB0: RGB2YUV coefficients register 1 */
    __RW uint32_t RGB2YUV_COEF2;               /* 0xB4: RGB2YUV coefficients register 2 */
    __RW uint32_t RGB2YUV_COEF3;               /* 0xB8: RGB2YUV coefficients register 3 */
    __RW uint32_t RGB2YUV_COEF4;               /* 0xBC: RGB2YUV coefficients register 4 */
} PDMA_Type;


/* Bitfield definition for register: CTRL */
/*
 * ARQOS (RW)
 *
 * QoS for AXI read bus
 */
#define PDMA_CTRL_ARQOS_MASK (0x780000UL)
#define PDMA_CTRL_ARQOS_SHIFT (19U)
#define PDMA_CTRL_ARQOS_SET(x) (((uint32_t)(x) << PDMA_CTRL_ARQOS_SHIFT) & PDMA_CTRL_ARQOS_MASK)
#define PDMA_CTRL_ARQOS_GET(x) (((uint32_t)(x) & PDMA_CTRL_ARQOS_MASK) >> PDMA_CTRL_ARQOS_SHIFT)

/*
 * AWQOS (RW)
 *
 * QoS for AXI write bus
 */
#define PDMA_CTRL_AWQOS_MASK (0x78000UL)
#define PDMA_CTRL_AWQOS_SHIFT (15U)
#define PDMA_CTRL_AWQOS_SET(x) (((uint32_t)(x) << PDMA_CTRL_AWQOS_SHIFT) & PDMA_CTRL_AWQOS_MASK)
#define PDMA_CTRL_AWQOS_GET(x) (((uint32_t)(x) & PDMA_CTRL_AWQOS_MASK) >> PDMA_CTRL_AWQOS_SHIFT)

/*
 * PACK_DIR (RW)
 *
 * Decide the byte sequence of the 32-bit output word {A3, A2, A1, A0}. The bit sequence ina byte is not changed.
 * 2'b00: no change {A3, A2, A1, A0}
 * 2'b01: {A2, A3, A0, A1}
 * 2'b10: {A1, A0, A3, A2}
 * 2'b11: {A0, A1, A2, A3}
 */
#define PDMA_CTRL_PACK_DIR_MASK (0x6000U)
#define PDMA_CTRL_PACK_DIR_SHIFT (13U)
#define PDMA_CTRL_PACK_DIR_SET(x) (((uint32_t)(x) << PDMA_CTRL_PACK_DIR_SHIFT) & PDMA_CTRL_PACK_DIR_MASK)
#define PDMA_CTRL_PACK_DIR_GET(x) (((uint32_t)(x) & PDMA_CTRL_PACK_DIR_MASK) >> PDMA_CTRL_PACK_DIR_SHIFT)

/*
 * AXIERR_IRQ_EN (RW)
 *
 * Enable interrupt of AXI bus error
 */
#define PDMA_CTRL_AXIERR_IRQ_EN_MASK (0x1000U)
#define PDMA_CTRL_AXIERR_IRQ_EN_SHIFT (12U)
#define PDMA_CTRL_AXIERR_IRQ_EN_SET(x) (((uint32_t)(x) << PDMA_CTRL_AXIERR_IRQ_EN_SHIFT) & PDMA_CTRL_AXIERR_IRQ_EN_MASK)
#define PDMA_CTRL_AXIERR_IRQ_EN_GET(x) (((uint32_t)(x) & PDMA_CTRL_AXIERR_IRQ_EN_MASK) >> PDMA_CTRL_AXIERR_IRQ_EN_SHIFT)

/*
 * PDMA_DONE_IRQ_EN (RW)
 *
 * Enable interrupt of PDMA_DONE
 */
#define PDMA_CTRL_PDMA_DONE_IRQ_EN_MASK (0x800U)
#define PDMA_CTRL_PDMA_DONE_IRQ_EN_SHIFT (11U)
#define PDMA_CTRL_PDMA_DONE_IRQ_EN_SET(x) (((uint32_t)(x) << PDMA_CTRL_PDMA_DONE_IRQ_EN_SHIFT) & PDMA_CTRL_PDMA_DONE_IRQ_EN_MASK)
#define PDMA_CTRL_PDMA_DONE_IRQ_EN_GET(x) (((uint32_t)(x) & PDMA_CTRL_PDMA_DONE_IRQ_EN_MASK) >> PDMA_CTRL_PDMA_DONE_IRQ_EN_SHIFT)

/*
 * CLKGATE (RW)
 *
 * Assert this bit to gate off clock when the module is not working. If reset to zero, the internal clock is always on.
 */
#define PDMA_CTRL_CLKGATE_MASK (0x200U)
#define PDMA_CTRL_CLKGATE_SHIFT (9U)
#define PDMA_CTRL_CLKGATE_SET(x) (((uint32_t)(x) << PDMA_CTRL_CLKGATE_SHIFT) & PDMA_CTRL_CLKGATE_MASK)
#define PDMA_CTRL_CLKGATE_GET(x) (((uint32_t)(x) & PDMA_CTRL_CLKGATE_MASK) >> PDMA_CTRL_CLKGATE_SHIFT)

/*
 * IRQ_EN (RW)
 *
 * Enable normal interrupt
 */
#define PDMA_CTRL_IRQ_EN_MASK (0x40U)
#define PDMA_CTRL_IRQ_EN_SHIFT (6U)
#define PDMA_CTRL_IRQ_EN_SET(x) (((uint32_t)(x) << PDMA_CTRL_IRQ_EN_SHIFT) & PDMA_CTRL_IRQ_EN_MASK)
#define PDMA_CTRL_IRQ_EN_GET(x) (((uint32_t)(x) & PDMA_CTRL_IRQ_EN_MASK) >> PDMA_CTRL_IRQ_EN_SHIFT)

/*
 * BS16 (RW)
 *
 * Asserted when the Block Size is 16x16, else 8x8
 */
#define PDMA_CTRL_BS16_MASK (0x20U)
#define PDMA_CTRL_BS16_SHIFT (5U)
#define PDMA_CTRL_BS16_SET(x) (((uint32_t)(x) << PDMA_CTRL_BS16_SHIFT) & PDMA_CTRL_BS16_MASK)
#define PDMA_CTRL_BS16_GET(x) (((uint32_t)(x) & PDMA_CTRL_BS16_MASK) >> PDMA_CTRL_BS16_SHIFT)

/*
 * P1_EN (RW)
 *
 * Plane 1 Enable
 */
#define PDMA_CTRL_P1_EN_MASK (0x10U)
#define PDMA_CTRL_P1_EN_SHIFT (4U)
#define PDMA_CTRL_P1_EN_SET(x) (((uint32_t)(x) << PDMA_CTRL_P1_EN_SHIFT) & PDMA_CTRL_P1_EN_MASK)
#define PDMA_CTRL_P1_EN_GET(x) (((uint32_t)(x) & PDMA_CTRL_P1_EN_MASK) >> PDMA_CTRL_P1_EN_SHIFT)

