RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_pdma_regs.h
/*
 * P0_EN (RW)
 *
 * Plane 0 Enable
 */
#define PDMA_CTRL_P0_EN_MASK (0x8U)
#define PDMA_CTRL_P0_EN_SHIFT (3U)
#define PDMA_CTRL_P0_EN_SET(x) (((uint32_t)(x) << PDMA_CTRL_P0_EN_SHIFT) & PDMA_CTRL_P0_EN_MASK)
#define PDMA_CTRL_P0_EN_GET(x) (((uint32_t)(x) & PDMA_CTRL_P0_EN_MASK) >> PDMA_CTRL_P0_EN_SHIFT)

/*
 * PDMA_SFTRST (RW)
 *
 * Software Reset.
 * Write 1 to clear PDMA internal logic.
 * Write 0 to exit software reset mode.
 */
#define PDMA_CTRL_PDMA_SFTRST_MASK (0x2U)
#define PDMA_CTRL_PDMA_SFTRST_SHIFT (1U)
#define PDMA_CTRL_PDMA_SFTRST_SET(x) (((uint32_t)(x) << PDMA_CTRL_PDMA_SFTRST_SHIFT) & PDMA_CTRL_PDMA_SFTRST_MASK)
#define PDMA_CTRL_PDMA_SFTRST_GET(x) (((uint32_t)(x) & PDMA_CTRL_PDMA_SFTRST_MASK) >> PDMA_CTRL_PDMA_SFTRST_SHIFT)

/*
 * PDMA_EN (RW)
 *
 * 1b - Enabled
 */
#define PDMA_CTRL_PDMA_EN_MASK (0x1U)
#define PDMA_CTRL_PDMA_EN_SHIFT (0U)
#define PDMA_CTRL_PDMA_EN_SET(x) (((uint32_t)(x) << PDMA_CTRL_PDMA_EN_SHIFT) & PDMA_CTRL_PDMA_EN_MASK)
#define PDMA_CTRL_PDMA_EN_GET(x) (((uint32_t)(x) & PDMA_CTRL_PDMA_EN_MASK) >> PDMA_CTRL_PDMA_EN_SHIFT)

/* Bitfield definition for register: STAT */
/*
 * BLOCKY (RO)
 *
 * Y block that is processing
 */
#define PDMA_STAT_BLOCKY_MASK (0xFF000000UL)
#define PDMA_STAT_BLOCKY_SHIFT (24U)
#define PDMA_STAT_BLOCKY_GET(x) (((uint32_t)(x) & PDMA_STAT_BLOCKY_MASK) >> PDMA_STAT_BLOCKY_SHIFT)

/*
 * BLOCKX (RO)
 *
 * X block that is processing
 */
#define PDMA_STAT_BLOCKX_MASK (0xFF0000UL)
#define PDMA_STAT_BLOCKX_SHIFT (16U)
#define PDMA_STAT_BLOCKX_GET(x) (((uint32_t)(x) & PDMA_STAT_BLOCKX_MASK) >> PDMA_STAT_BLOCKX_SHIFT)

/*
 * PDMA_DONE (W1C)
 *
 * PDMA one image done
 */
#define PDMA_STAT_PDMA_DONE_MASK (0x200U)
#define PDMA_STAT_PDMA_DONE_SHIFT (9U)
#define PDMA_STAT_PDMA_DONE_SET(x) (((uint32_t)(x) << PDMA_STAT_PDMA_DONE_SHIFT) & PDMA_STAT_PDMA_DONE_MASK)
#define PDMA_STAT_PDMA_DONE_GET(x) (((uint32_t)(x) & PDMA_STAT_PDMA_DONE_MASK) >> PDMA_STAT_PDMA_DONE_SHIFT)

/*
 * AXI_ERR_ID (RO)
 *
 * AXI error ID
 */
#define PDMA_STAT_AXI_ERR_ID_MASK (0x1E0U)
#define PDMA_STAT_AXI_ERR_ID_SHIFT (5U)
#define PDMA_STAT_AXI_ERR_ID_GET(x) (((uint32_t)(x) & PDMA_STAT_AXI_ERR_ID_MASK) >> PDMA_STAT_AXI_ERR_ID_SHIFT)

/*
 * AXI_0_WRITE_ERR (W1C)
 *
 * AXI0 write err
 */
#define PDMA_STAT_AXI_0_WRITE_ERR_MASK (0x10U)
#define PDMA_STAT_AXI_0_WRITE_ERR_SHIFT (4U)
#define PDMA_STAT_AXI_0_WRITE_ERR_SET(x) (((uint32_t)(x) << PDMA_STAT_AXI_0_WRITE_ERR_SHIFT) & PDMA_STAT_AXI_0_WRITE_ERR_MASK)
#define PDMA_STAT_AXI_0_WRITE_ERR_GET(x) (((uint32_t)(x) & PDMA_STAT_AXI_0_WRITE_ERR_MASK) >> PDMA_STAT_AXI_0_WRITE_ERR_SHIFT)

/*
 * AXI_1_READ_ERR (W1C)
 *
 * AXI1 read err
 */
#define PDMA_STAT_AXI_1_READ_ERR_MASK (0x8U)
#define PDMA_STAT_AXI_1_READ_ERR_SHIFT (3U)
#define PDMA_STAT_AXI_1_READ_ERR_SET(x) (((uint32_t)(x) << PDMA_STAT_AXI_1_READ_ERR_SHIFT) & PDMA_STAT_AXI_1_READ_ERR_MASK)
#define PDMA_STAT_AXI_1_READ_ERR_GET(x) (((uint32_t)(x) & PDMA_STAT_AXI_1_READ_ERR_MASK) >> PDMA_STAT_AXI_1_READ_ERR_SHIFT)

/*
 * AXI_0_READ_ERR (W1C)
 *
 * AXI0 read err
 */
#define PDMA_STAT_AXI_0_READ_ERR_MASK (0x4U)
#define PDMA_STAT_AXI_0_READ_ERR_SHIFT (2U)
#define PDMA_STAT_AXI_0_READ_ERR_SET(x) (((uint32_t)(x) << PDMA_STAT_AXI_0_READ_ERR_SHIFT) & PDMA_STAT_AXI_0_READ_ERR_MASK)
#define PDMA_STAT_AXI_0_READ_ERR_GET(x) (((uint32_t)(x) & PDMA_STAT_AXI_0_READ_ERR_MASK) >> PDMA_STAT_AXI_0_READ_ERR_SHIFT)

/*
 * IRQ (RO)
 *
 * Asserted to indicate a IRQ event
 */
#define PDMA_STAT_IRQ_MASK (0x1U)
#define PDMA_STAT_IRQ_SHIFT (0U)
#define PDMA_STAT_IRQ_GET(x) (((uint32_t)(x) & PDMA_STAT_IRQ_MASK) >> PDMA_STAT_IRQ_SHIFT)

/* Bitfield definition for register: OUT_CTRL */
/*
 * DSTALPHA (RW)
 *
 * The destination (P1) system ALPHA value.
 */
#define PDMA_OUT_CTRL_DSTALPHA_MASK (0xFF000000UL)
#define PDMA_OUT_CTRL_DSTALPHA_SHIFT (24U)
#define PDMA_OUT_CTRL_DSTALPHA_SET(x) (((uint32_t)(x) << PDMA_OUT_CTRL_DSTALPHA_SHIFT) & PDMA_OUT_CTRL_DSTALPHA_MASK)
#define PDMA_OUT_CTRL_DSTALPHA_GET(x) (((uint32_t)(x) & PDMA_OUT_CTRL_DSTALPHA_MASK) >> PDMA_OUT_CTRL_DSTALPHA_SHIFT)

/*
 * SRCALPHA (RW)
 *
 * The source (P0) system ALPHA value.
 */
#define PDMA_OUT_CTRL_SRCALPHA_MASK (0xFF0000UL)
#define PDMA_OUT_CTRL_SRCALPHA_SHIFT (16U)
#define PDMA_OUT_CTRL_SRCALPHA_SET(x) (((uint32_t)(x) << PDMA_OUT_CTRL_SRCALPHA_SHIFT) & PDMA_OUT_CTRL_SRCALPHA_MASK)
#define PDMA_OUT_CTRL_SRCALPHA_GET(x) (((uint32_t)(x) & PDMA_OUT_CTRL_SRCALPHA_MASK) >> PDMA_OUT_CTRL_SRCALPHA_SHIFT)

/*
 * DSTALPHA_OP (RW)
 *
 * The usage of the DSTALPHA[7:0]: (The system alpha value is not the data valid mask, the non-zero alpha value per pixel embedded in the stream indicates a valid pixel. If no such per pixel alpha value, it means all the pixels are valid)
 * 0: the DSTALPHA[7:0] is invalid, use the alpha value embedded in the stream
 * 1: the DSTALPHA[7:0] is used to override the alpha value embedded in the stream.  (useful when the corresponding data stream has no alpha info)
 * 2: the DSTALPHA[7:0] is used to scale the alpha value embedded in the stream
 * 3: don't multiply the color data with any alpha values for blender inputs.
 */
#define PDMA_OUT_CTRL_DSTALPHA_OP_MASK (0xC000U)
#define PDMA_OUT_CTRL_DSTALPHA_OP_SHIFT (14U)
#define PDMA_OUT_CTRL_DSTALPHA_OP_SET(x) (((uint32_t)(x) << PDMA_OUT_CTRL_DSTALPHA_OP_SHIFT) & PDMA_OUT_CTRL_DSTALPHA_OP_MASK)
#define PDMA_OUT_CTRL_DSTALPHA_OP_GET(x) (((uint32_t)(x) & PDMA_OUT_CTRL_DSTALPHA_OP_MASK) >> PDMA_OUT_CTRL_DSTALPHA_OP_SHIFT)

/*
 * SRCALPHA_OP (RW)
 *
 * The usage of the SRCALPHA[7:0]: (The system alpha value is not the data valid mask, the non-zero alpha value per pixel embedded in the stream indicates a valid pixel. If no such per pixel alpha value, it means all the pixels are valid)
 * 0: the SRCALPHA[7:0] is invalid, use the alpha value embedded in the stream
 * 1: the SRCALPHA[7:0] is used to override the alpha value embedded in the stream .  (useful when the corresponding data stream has no alpha info)
 * 2: the SRCALPHA[7:0] is used to scale the alpha value embedded in the stream
 * 3: don't multiply the color data with any alpha values for blender inputs.
 */
#define PDMA_OUT_CTRL_SRCALPHA_OP_MASK (0x3000U)
#define PDMA_OUT_CTRL_SRCALPHA_OP_SHIFT (12U)
#define PDMA_OUT_CTRL_SRCALPHA_OP_SET(x) (((uint32_t)(x) << PDMA_OUT_CTRL_SRCALPHA_OP_SHIFT) & PDMA_OUT_CTRL_SRCALPHA_OP_MASK)
#define PDMA_OUT_CTRL_SRCALPHA_OP_GET(x) (((uint32_t)(x) & PDMA_OUT_CTRL_SRCALPHA_OP_MASK) >> PDMA_OUT_CTRL_SRCALPHA_OP_SHIFT)

