RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_pdma_regs.h
/*
 * INB13_SWAP (RW)
 *
 * Swap bit[31:24] and bit [15:8] before pack_dir operation.
 */
#define PDMA_PS_CTRL_INB13_SWAP_MASK (0x100000UL)
#define PDMA_PS_CTRL_INB13_SWAP_SHIFT (20U)
#define PDMA_PS_CTRL_INB13_SWAP_SET(x) (((uint32_t)(x) << PDMA_PS_CTRL_INB13_SWAP_SHIFT) & PDMA_PS_CTRL_INB13_SWAP_MASK)
#define PDMA_PS_CTRL_INB13_SWAP_GET(x) (((uint32_t)(x) & PDMA_PS_CTRL_INB13_SWAP_MASK) >> PDMA_PS_CTRL_INB13_SWAP_SHIFT)

/*
 * PACK_DIR (RW)
 *
 * Decide the byte sequence of the 32-bit word {A3, A2, A1, A0}. The bit sequence ina byte is not changed.
 * 2'b00: no change {A3, A2, A1, A0}
 * 2'b01: {A2, A3, A0, A1}
 * 2'b10: {A1, A0, A3, A2}
 * 2'b11: {A0, A1, A2, A3}
 */
#define PDMA_PS_CTRL_PACK_DIR_MASK (0xC0000UL)
#define PDMA_PS_CTRL_PACK_DIR_SHIFT (18U)
#define PDMA_PS_CTRL_PACK_DIR_SET(x) (((uint32_t)(x) << PDMA_PS_CTRL_PACK_DIR_SHIFT) & PDMA_PS_CTRL_PACK_DIR_MASK)
#define PDMA_PS_CTRL_PACK_DIR_GET(x) (((uint32_t)(x) & PDMA_PS_CTRL_PACK_DIR_MASK) >> PDMA_PS_CTRL_PACK_DIR_SHIFT)

/*
 * BKGCL4CLR (RW)
 *
 * Enable to use background color for clear area
 */
#define PDMA_PS_CTRL_BKGCL4CLR_MASK (0x20000UL)
#define PDMA_PS_CTRL_BKGCL4CLR_SHIFT (17U)
#define PDMA_PS_CTRL_BKGCL4CLR_SET(x) (((uint32_t)(x) << PDMA_PS_CTRL_BKGCL4CLR_SHIFT) & PDMA_PS_CTRL_BKGCL4CLR_MASK)
#define PDMA_PS_CTRL_BKGCL4CLR_GET(x) (((uint32_t)(x) & PDMA_PS_CTRL_BKGCL4CLR_MASK) >> PDMA_PS_CTRL_BKGCL4CLR_SHIFT)

/*
 * YCBCR_MODE (RW)
 *
 * YCbCr mode or YUV mode
 */
#define PDMA_PS_CTRL_YCBCR_MODE_MASK (0x10000UL)
#define PDMA_PS_CTRL_YCBCR_MODE_SHIFT (16U)
#define PDMA_PS_CTRL_YCBCR_MODE_SET(x) (((uint32_t)(x) << PDMA_PS_CTRL_YCBCR_MODE_SHIFT) & PDMA_PS_CTRL_YCBCR_MODE_MASK)
#define PDMA_PS_CTRL_YCBCR_MODE_GET(x) (((uint32_t)(x) & PDMA_PS_CTRL_YCBCR_MODE_MASK) >> PDMA_PS_CTRL_YCBCR_MODE_SHIFT)

/*
 * BYPASS (RW)
 *
 * Asserted to bypass the CSC stage
 */
#define PDMA_PS_CTRL_BYPASS_MASK (0x8000U)
#define PDMA_PS_CTRL_BYPASS_SHIFT (15U)
#define PDMA_PS_CTRL_BYPASS_SET(x) (((uint32_t)(x) << PDMA_PS_CTRL_BYPASS_SHIFT) & PDMA_PS_CTRL_BYPASS_MASK)
#define PDMA_PS_CTRL_BYPASS_GET(x) (((uint32_t)(x) & PDMA_PS_CTRL_BYPASS_MASK) >> PDMA_PS_CTRL_BYPASS_SHIFT)

/*
 * VFLIP (RW)
 *
 * Indicates that the input should be flipped vertically (effect applied before rotation).
 */
#define PDMA_PS_CTRL_VFLIP_MASK (0x4000U)
#define PDMA_PS_CTRL_VFLIP_SHIFT (14U)
#define PDMA_PS_CTRL_VFLIP_SET(x) (((uint32_t)(x) << PDMA_PS_CTRL_VFLIP_SHIFT) & PDMA_PS_CTRL_VFLIP_MASK)
#define PDMA_PS_CTRL_VFLIP_GET(x) (((uint32_t)(x) & PDMA_PS_CTRL_VFLIP_MASK) >> PDMA_PS_CTRL_VFLIP_SHIFT)

/*
 * HFLIP (RW)
 *
 * Indicates that the input should be flipped horizontally (effect applied before rotation).
 */
#define PDMA_PS_CTRL_HFLIP_MASK (0x2000U)
#define PDMA_PS_CTRL_HFLIP_SHIFT (13U)
#define PDMA_PS_CTRL_HFLIP_SET(x) (((uint32_t)(x) << PDMA_PS_CTRL_HFLIP_SHIFT) & PDMA_PS_CTRL_HFLIP_MASK)
#define PDMA_PS_CTRL_HFLIP_GET(x) (((uint32_t)(x) & PDMA_PS_CTRL_HFLIP_MASK) >> PDMA_PS_CTRL_HFLIP_SHIFT)

/*
 * ROTATE (RW)
 *
 * Indicates the clockwise rotation to be applied at the input buffer. The rotation effect is defined as occurring
 * after the FLIP_X and FLIP_Y permutation.
 * 0x0 ROT_0
 * 0x1 ROT_90
 * 0x2 ROT_180
 * 0x3 ROT_270
 */
#define PDMA_PS_CTRL_ROTATE_MASK (0x1800U)
#define PDMA_PS_CTRL_ROTATE_SHIFT (11U)
#define PDMA_PS_CTRL_ROTATE_SET(x) (((uint32_t)(x) << PDMA_PS_CTRL_ROTATE_SHIFT) & PDMA_PS_CTRL_ROTATE_MASK)
#define PDMA_PS_CTRL_ROTATE_GET(x) (((uint32_t)(x) & PDMA_PS_CTRL_ROTATE_MASK) >> PDMA_PS_CTRL_ROTATE_SHIFT)

/*
 * DECY (RW)
 *
 * Verticle pre decimation filter control.
 * 0x0 DISABLE - Disable pre-decimation filter.
 * 0x1 DECY2  - Decimate PS by 2.
 * 0x2 DECY4 - Decimate PS by 4.
 * 0x3 DECY8 - Decimate PS by 8.
 */
#define PDMA_PS_CTRL_DECY_MASK (0x600U)
#define PDMA_PS_CTRL_DECY_SHIFT (9U)
#define PDMA_PS_CTRL_DECY_SET(x) (((uint32_t)(x) << PDMA_PS_CTRL_DECY_SHIFT) & PDMA_PS_CTRL_DECY_MASK)
#define PDMA_PS_CTRL_DECY_GET(x) (((uint32_t)(x) & PDMA_PS_CTRL_DECY_MASK) >> PDMA_PS_CTRL_DECY_SHIFT)

/*
 * DECX (RW)
 *
 * Horizontal pre decimation filter control.
 * 0x0 DISABLE - Disable pre-decimation filter.
 * 0x1 DECX2 - Decimate PS by 2.
 * 0x2 DECX4 - Decimate PS by 4.
 * 0x3 DECX8 - Decimate PS by 8.
 */
#define PDMA_PS_CTRL_DECX_MASK (0x180U)
#define PDMA_PS_CTRL_DECX_SHIFT (7U)
#define PDMA_PS_CTRL_DECX_SET(x) (((uint32_t)(x) << PDMA_PS_CTRL_DECX_SHIFT) & PDMA_PS_CTRL_DECX_MASK)
#define PDMA_PS_CTRL_DECX_GET(x) (((uint32_t)(x) & PDMA_PS_CTRL_DECX_MASK) >> PDMA_PS_CTRL_DECX_SHIFT)

/*
 * HW_BYTE_SWAP (RW)
 *
 * Swap bytes in half-words. For each 16 bit half-word, the two bytes will be swapped.
 */
#define PDMA_PS_CTRL_HW_BYTE_SWAP_MASK (0x40U)
#define PDMA_PS_CTRL_HW_BYTE_SWAP_SHIFT (6U)
#define PDMA_PS_CTRL_HW_BYTE_SWAP_SET(x) (((uint32_t)(x) << PDMA_PS_CTRL_HW_BYTE_SWAP_SHIFT) & PDMA_PS_CTRL_HW_BYTE_SWAP_MASK)
#define PDMA_PS_CTRL_HW_BYTE_SWAP_GET(x) (((uint32_t)(x) & PDMA_PS_CTRL_HW_BYTE_SWAP_MASK) >> PDMA_PS_CTRL_HW_BYTE_SWAP_SHIFT)

/*
 * FORMAT (RW)
 *
 * PS buffer format. To select between YUV and YCbCr formats, see bit 16 of this register.
 * 0x0 ARGB888 - 32-bit pixels, byte sequence as B,G,R,A
 * 0xE RGB565 - 16-bit pixels, byte sequence as B,R
 * 0x13 YUYV1P422 - 16-bit pixels (1-plane byte sequence Y0,U0,Y1,V0 interleaved bytes)
 */
#define PDMA_PS_CTRL_FORMAT_MASK (0x3FU)
#define PDMA_PS_CTRL_FORMAT_SHIFT (0U)
#define PDMA_PS_CTRL_FORMAT_SET(x) (((uint32_t)(x) << PDMA_PS_CTRL_FORMAT_SHIFT) & PDMA_PS_CTRL_FORMAT_MASK)
#define PDMA_PS_CTRL_FORMAT_GET(x) (((uint32_t)(x) & PDMA_PS_CTRL_FORMAT_MASK) >> PDMA_PS_CTRL_FORMAT_SHIFT)

/* Bitfield definition for register of struct array PS: BUF */
/*
 * ADDR (RW)
 *
 * Address pointer for the PS RGB or Y (luma) input buffer.
 */
#define PDMA_PS_BUF_ADDR_MASK (0xFFFFFFFFUL)
#define PDMA_PS_BUF_ADDR_SHIFT (0U)
#define PDMA_PS_BUF_ADDR_SET(x) (((uint32_t)(x) << PDMA_PS_BUF_ADDR_SHIFT) & PDMA_PS_BUF_ADDR_MASK)
#define PDMA_PS_BUF_ADDR_GET(x) (((uint32_t)(x) & PDMA_PS_BUF_ADDR_MASK) >> PDMA_PS_BUF_ADDR_SHIFT)

