RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_pdma_regs.h
/* Bitfield definition for register of struct array PS: PITCH */
/*
 * BYTELEN (RW)
 *
 * Indicates the number of bytes in memory between two vertically adjacent pixels.
 */
#define PDMA_PS_PITCH_BYTELEN_MASK (0xFFFFU)
#define PDMA_PS_PITCH_BYTELEN_SHIFT (0U)
#define PDMA_PS_PITCH_BYTELEN_SET(x) (((uint32_t)(x) << PDMA_PS_PITCH_BYTELEN_SHIFT) & PDMA_PS_PITCH_BYTELEN_MASK)
#define PDMA_PS_PITCH_BYTELEN_GET(x) (((uint32_t)(x) & PDMA_PS_PITCH_BYTELEN_MASK) >> PDMA_PS_PITCH_BYTELEN_SHIFT)

/* Bitfield definition for register of struct array PS: BKGD */
/*
 * COLOR (RW)
 *
 * Background color (in 32bpp format) for any pixels not within the scaled range of the picture, but within the buffer range specified by the PS ULC/LRC. The top 8-bit is the alpha channel.
 */
#define PDMA_PS_BKGD_COLOR_MASK (0xFFFFFFFFUL)
#define PDMA_PS_BKGD_COLOR_SHIFT (0U)
#define PDMA_PS_BKGD_COLOR_SET(x) (((uint32_t)(x) << PDMA_PS_BKGD_COLOR_SHIFT) & PDMA_PS_BKGD_COLOR_MASK)
#define PDMA_PS_BKGD_COLOR_GET(x) (((uint32_t)(x) & PDMA_PS_BKGD_COLOR_MASK) >> PDMA_PS_BKGD_COLOR_SHIFT)

/* Bitfield definition for register of struct array PS: SCALE */
/*
 * Y (RW)
 *
 * This is a two bit integer and 12 bit fractional representation (##.####_####_####) of the X scaling factor for the PS source buffer. The maximum value programmed should be 2 since scaling down by a factor greater than 2 is not supported with the bilinear filter. Decimation and the bilinear filter should be used together to achieve scaling by more than a factor of 2.
 */
#define PDMA_PS_SCALE_Y_MASK (0x7FFF0000UL)
#define PDMA_PS_SCALE_Y_SHIFT (16U)
#define PDMA_PS_SCALE_Y_SET(x) (((uint32_t)(x) << PDMA_PS_SCALE_Y_SHIFT) & PDMA_PS_SCALE_Y_MASK)
#define PDMA_PS_SCALE_Y_GET(x) (((uint32_t)(x) & PDMA_PS_SCALE_Y_MASK) >> PDMA_PS_SCALE_Y_SHIFT)

/*
 * X (RW)
 *
 * This is a two bit integer and 12 bit fractional representation (##.####_####_####) of the Y scaling factor for the PS source buffer. The maximum value programmed should be 2 since scaling down by a factor greater than 2 is not supported with the bilinear filter. Decimation and the bilinear filter should be used together to achieve scaling by more than a factor of 2.
 */
#define PDMA_PS_SCALE_X_MASK (0x7FFFU)
#define PDMA_PS_SCALE_X_SHIFT (0U)
#define PDMA_PS_SCALE_X_SET(x) (((uint32_t)(x) << PDMA_PS_SCALE_X_SHIFT) & PDMA_PS_SCALE_X_MASK)
#define PDMA_PS_SCALE_X_GET(x) (((uint32_t)(x) & PDMA_PS_SCALE_X_MASK) >> PDMA_PS_SCALE_X_SHIFT)

/* Bitfield definition for register of struct array PS: OFFSET */
/*
 * Y (RW)
 *
 * This is a 12 bit fractional representation (0.####_####_####) of the Y scaling offset. This represents a fixed pixel offset which gets added to the scaled address to determine source data for the scaling engine.
 * It is applied after the decimation filter stage, and before the bilinear filter stage.
 */
#define PDMA_PS_OFFSET_Y_MASK (0xFFF0000UL)
#define PDMA_PS_OFFSET_Y_SHIFT (16U)
#define PDMA_PS_OFFSET_Y_SET(x) (((uint32_t)(x) << PDMA_PS_OFFSET_Y_SHIFT) & PDMA_PS_OFFSET_Y_MASK)
#define PDMA_PS_OFFSET_Y_GET(x) (((uint32_t)(x) & PDMA_PS_OFFSET_Y_MASK) >> PDMA_PS_OFFSET_Y_SHIFT)

/*
 * X (RW)
 *
 * This is a 12 bit fractional representation (0.####_####_####) of the X scaling offset. This represents a fixed pixel offset which gets added to the scaled address to determine source data for the scaling engine.
 * It is applied after the decimation filter stage, and before the bilinear filter stage.
 */
#define PDMA_PS_OFFSET_X_MASK (0xFFFU)
#define PDMA_PS_OFFSET_X_SHIFT (0U)
#define PDMA_PS_OFFSET_X_SET(x) (((uint32_t)(x) << PDMA_PS_OFFSET_X_SHIFT) & PDMA_PS_OFFSET_X_MASK)
#define PDMA_PS_OFFSET_X_GET(x) (((uint32_t)(x) & PDMA_PS_OFFSET_X_MASK) >> PDMA_PS_OFFSET_X_SHIFT)

/* Bitfield definition for register of struct array PS: CLRKEY_LOW */
/*
 * LIMIT (RW)
 *
 * Low range of color key applied to PS buffer. To disable PS colorkeying, set the low colorkey to 0xFFFFFF and the high colorkey to 0x000000.
 */
#define PDMA_PS_CLRKEY_LOW_LIMIT_MASK (0xFFFFFFUL)
#define PDMA_PS_CLRKEY_LOW_LIMIT_SHIFT (0U)
#define PDMA_PS_CLRKEY_LOW_LIMIT_SET(x) (((uint32_t)(x) << PDMA_PS_CLRKEY_LOW_LIMIT_SHIFT) & PDMA_PS_CLRKEY_LOW_LIMIT_MASK)
#define PDMA_PS_CLRKEY_LOW_LIMIT_GET(x) (((uint32_t)(x) & PDMA_PS_CLRKEY_LOW_LIMIT_MASK) >> PDMA_PS_CLRKEY_LOW_LIMIT_SHIFT)

/* Bitfield definition for register of struct array PS: CLRKEY_HIGH */
/*
 * LIMIT (RW)
 *
 * High range of color key applied to PS buffer. To disable PS colorkeying, set the low colorkey to 0xFFFFFF and the high colorkey to 0x000000
 */
#define PDMA_PS_CLRKEY_HIGH_LIMIT_MASK (0xFFFFFFUL)
#define PDMA_PS_CLRKEY_HIGH_LIMIT_SHIFT (0U)
#define PDMA_PS_CLRKEY_HIGH_LIMIT_SET(x) (((uint32_t)(x) << PDMA_PS_CLRKEY_HIGH_LIMIT_SHIFT) & PDMA_PS_CLRKEY_HIGH_LIMIT_MASK)
#define PDMA_PS_CLRKEY_HIGH_LIMIT_GET(x) (((uint32_t)(x) & PDMA_PS_CLRKEY_HIGH_LIMIT_MASK) >> PDMA_PS_CLRKEY_HIGH_LIMIT_SHIFT)

/* Bitfield definition for register of struct array PS: ORG */
/*
 * HIGHT (RW)
 *
 * The number of vertical pixels of the original frame (not -1)
 */
#define PDMA_PS_ORG_HIGHT_MASK (0x3FFF0000UL)
#define PDMA_PS_ORG_HIGHT_SHIFT (16U)
#define PDMA_PS_ORG_HIGHT_SET(x) (((uint32_t)(x) << PDMA_PS_ORG_HIGHT_SHIFT) & PDMA_PS_ORG_HIGHT_MASK)
#define PDMA_PS_ORG_HIGHT_GET(x) (((uint32_t)(x) & PDMA_PS_ORG_HIGHT_MASK) >> PDMA_PS_ORG_HIGHT_SHIFT)

/*
 * WIDTH (RW)
 *
 * The number of horizontal pixels of the original frame (not -1)
 */
#define PDMA_PS_ORG_WIDTH_MASK (0x3FFFU)
#define PDMA_PS_ORG_WIDTH_SHIFT (0U)
#define PDMA_PS_ORG_WIDTH_SET(x) (((uint32_t)(x) << PDMA_PS_ORG_WIDTH_SHIFT) & PDMA_PS_ORG_WIDTH_MASK)
#define PDMA_PS_ORG_WIDTH_GET(x) (((uint32_t)(x) & PDMA_PS_ORG_WIDTH_MASK) >> PDMA_PS_ORG_WIDTH_SHIFT)

/* Bitfield definition for register: YUV2RGB_COEF0 */
/*
 * C0 (RW)
 *
 * Two's compliment Y multiplier coefficient C0. YUV=0x100 (1.000) YCbCr=0x12A (1.164)
 */
#define PDMA_YUV2RGB_COEF0_C0_MASK (0x1FFC0000UL)
#define PDMA_YUV2RGB_COEF0_C0_SHIFT (18U)
#define PDMA_YUV2RGB_COEF0_C0_SET(x) (((uint32_t)(x) << PDMA_YUV2RGB_COEF0_C0_SHIFT) & PDMA_YUV2RGB_COEF0_C0_MASK)
#define PDMA_YUV2RGB_COEF0_C0_GET(x) (((uint32_t)(x) & PDMA_YUV2RGB_COEF0_C0_MASK) >> PDMA_YUV2RGB_COEF0_C0_SHIFT)

